{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-POP.6.4",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "POP_6_4_Support_for_Care_System_Performance_Indicators__Dashboards_",
  "title": "POP.6.4 Support for Care System Performance Indicators (Dashboards) (Function)",
  "status": "active",
  "description": "Capture, determine and render data necessary to support health care organizational performance monitoring and improvement.",
  "purpose": "Health care organizations and institutions may seek to display summary information to assist in care system performance, in the form of dashboards and graphic displays, to support delivery of care and improvement of processes. These dashboards should utilize all appropriate data available in the system to address the healthcare system's process improvement and care delivery issues and then display the results in appropriate role-based formats. These displays may be in the form of routine daily, weekly or monthly graphics or real-time displays of selected metrics to improve care delivery, and/or performance. Note: Even though the system may be capable of automatically managing certain data-driven feedback mechanisms, it is also necessary for the provider to have the ability of manually managing certain feedback mechanisms (e.g., by overriding the system's choices).",
  "statement": [
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.6.4-01",
      "label": "POP.6.4#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage at least one data-driven feedback mechanism (e.g., reports, dashboards, or watchboards) to assist in patient management and healthcare delivery."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.6.4-02",
      "label": "POP.6.4#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to manage multiple data-driven feedback mechanisms (e.g., reports, dashboards, or watchboards) to assist in patient management and healthcare delivery according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.6.4-03",
      "label": "POP.6.4#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD render real-time departmental load metrics (e.g., nurse-to-patient ratios, Emergency department capacity limits), automatically (i.e., without further human intervention)."
    }
  ]
}