{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-TI.1.2",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_1_2_Entity_Authorization",
  "title": "TI.1.2 Entity Authorization (Function)",
  "status": "active",
  "description": "Manage set(s) of EHR-S access control permissions.",
  "purpose": "Entities are authorized to use components of an EHR-S in accordance with their scope of practice within local policy or legal jurisdiction. Authorization rules provide a proper framework for establishing access permissions and privileges for the use of an EHR system, based on user, role or context. A combination of these authorization categories may be applied to control access to EHR-S resources (i.e., functions or data), including at the operating system level.\n- User based authorization refers to the permissions granted to access EHR-S resources based on the identity of an entity (e.g., user or software component).\n- Role based authorization refers to the permissions granted to access EHR-S resources based on the role of an entity. Examples of roles include: an application or device (tele-monitor or robotic); or a nurse, dietician, administrator, legal guardian, and auditor.\n- Context-based Authorization refers to the permissions granted to access EHR-S resources within a context, such as when a request occurs, explicit time, location, route of access, quality of authentication, work assignment, patient consents and authorization. See ISO 10181-3 Technical Framework for Access Control Standard. For example, an EHR-S might only allow supervising providers' context authorization to attest to entries proposed by residents under their supervision.",
  "statement": [
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-TI.1.2-01",
      "label": "TI.1.2#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage sets of access-control permissions granted to an entity (e.g., user, application, device) based on identity, role, and/or context according to scope of practice, organizational policy, and/or jurisdictional law.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.1.2#1"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.1.2-02",
      "label": "TI.1.2#02",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL conform to function [[TI.2]] (Audit) to audit authorization actions as security events.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.1.2#2"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-TI.1.2-03",
      "label": "TI.1.2#03",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage roles (e.g., clinician versus administrator) and contexts (e.g., legal requirements versus emergency situations) for authorization according to scope of practice, organizational policy, and/or jurisdictional law.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.1.2#3"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.1.2-04",
      "label": "TI.1.2#04",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL maintain a revision history of all entity record modifications."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-TI.1.2-05",
      "label": "TI.1.2#05",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability to manage authorizations for the use of portable media in according to scope of practice, organizational policy, and/or jurisdictional law."
    }
  ]
}