{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-CPS.2.2",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
      "valueCode": "normative"
    }
  ],
  "name": "CPS_2_2_Support_externally_sourced_Clinical_Data",
  "title": "CPS.2.2 Support externally-sourced Clinical Data (Function)",
  "status": "active",
  "description": "Incorporate discrete clinical data from external sources and support communication/presentation of data captured from medical and non-medical devices and entities.",
  "purpose": "Mechanisms for incorporating external clinical data (including identification of source) are available and communication with non-medical devices and entities is supported as appropriate to the care setting such as an office or a patient's home. Externally-sourced data may be presented with locally-sourced documentation and notes wherever appropriate. This covers all types of data received by the provider that would typically be incorporated into a medical record, including but not limited to faxes, referral authorizations, consultant reports, and patient/resident correspondence of a clinical nature. Intrinsic to the concept of electronic health records is the ability to exchange health information with other providers of health care services. Health information from these external sources needs to be received, stored in the patient record, and displayed upon request.\n\nExamples of externally-sourced data and documents include:\n\n- Laboratory results received through an electronic interface. \n  This information is received and stored in the resident record as discrete data, which means that each separate element of the data needs to be stored in its own field. Therefore, if laboratory results are received through an electronic interface, the results are received in the EHR and the laboratory test name, result (value), and unit of measure are correctly displayed as discrete data (instead of in report or summarized format). \n\n- Scanned documents received and stored as images (e.g., power of attorney forms or living wills). \n  These scanned documents are indexed and can be retrieved, e.g., based on the document type, date of the original document, and the date of scanning. \n\n- Text-based outside reports (e.g., x-ray reports, hospital discharge summaries or history and physical examinations). \n  Any mechanism for capturing these reports is acceptable (e.g., OCR, PDF, JPG or TIFF). \n\n- Clinical images from an external source (e.g., radiographic images, digital images from a diagnostic scan or graphical images). \n  These images may be stored within the system or be available by direct linkage to an external source (e.g., a hospital's picture archiving and communication system). \n\n- Other forms of clinical results (e.g., EKG waveforms).\n\n- Medication history from an external source such as a retail pharmacy, the patient, or another provider . \n  While the medication history includes the medication name, strength, and SIG, this does not imply that the data will populate the medication administration module. In many systems the medication administration module is populated from the medication order rather than from the medication history.\n\n- Structured, text-based reports (e.g., medical summary text in a structured format). \n\n- Standards-based structured, codified data (such as a standards-based referral letter that contains SNOMED CT codes). \n\nSuch data may be presented with locally-sourced documentation and notes wherever appropriate.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-01",
      "label": "CPS.2.2#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and store computable data (e.g., laboratory results, telemetry, or medication details)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-02",
      "label": "CPS.2.2#02",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and store a reference to external data."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-03",
      "label": "CPS.2.2#03",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and store externally-sourced computable data (e.g., laboratory results, telemetry, medication details).",
      "derivedFrom": "EHR-S_FM_R1.1 DC.1.1.3.1#9"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-04",
      "label": "CPS.2.2#04",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and store externally-sourced standards-based structured, codified data.",
      "derivedFrom": "EHR-S_FM_R1.1 DC.1.1.3.1#11"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-05",
      "label": "CPS.2.2#05",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture and store laboratory test data as discrete data elements (e.g., test name, laboratory sample status, date/time of collection, test results, original test units, laboratory panel name, pre-defined testing conditions met indicator, specimen identifier, reference range lower limit, reference range upper limit, laboratory identifier, abnormal flag, and clinical significance indicator)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-06",
      "label": "CPS.2.2#06",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture and store externally-sourced clinical documentation as structured data, where appropriate, including the original, updates and addenda."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-07",
      "label": "CPS.2.2#07",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture and store health-related data from non-medical devices (e.g., digital camera or sound recorder)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-CPS.2.2-08",
      "label": "CPS.2.2#08",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture the original requisition ID number associated with an order."
    }
  ]
}