{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-AS.2.2",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "AS_2_2_Manage_Patient_s_Location_Within_Facility",
  "title": "AS.2.2 Manage Patient's Location Within Facility (Function)",
  "status": "active",
  "description": "Provide the patient's location information within a facility's premises.",
  "purpose": "It is important to maintain, and/or provide access to information regarding the patient's location within a facility during an episode of care. This information can be as simple as the identification of the patient's bed assignment (e.g., John Doe1, Bed 3, Ward 2). It is also important to provide real-time information regarding the patient's location since they may receive ancillary services in multiple parts of the facility (e.g., in the physical therapy or diagnostic imaging departments). Note: The patient's location within a facility may also be revealed by viewing standard reports (such as an Emergency Department Log). The system should support viewing a patient's specific location in terms that may include campus, building, wing, unit, room, and/or bed. The system should support jurisdictional laws related to the patient's ability (or desire) to consent to disclose their location within a facility (e.g., it may be unlawful to require a minor child to sign a consent form regarding their location in a facility). The patient's location information within the facility should also be available even before the patient is ascribed to a specific provider within that facility. As such, the system may need to provide a query feature regarding the patient's location information. The system may also support the identification of the patient by alternate identifying names (e.g., John Doe1 or \"J. Doe1\"). For example, the patient's physical therapist may be permitted to view an elderly patient's location within a long term care facility, but the patient's pharmacist may be restricted from viewing that information.",
  "statement": [
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-01",
      "label": "AS.2.2#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to render information regarding the patient's assigned location when the patient has an assigned location (e.g., specific bed).",
      "derivedFrom": "EHR-S_FM_R1.1 S.1.4.2#1"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-02",
      "label": "AS.2.2#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render information regarding a patient's location based on existing patient-consent documentation and according to scope of practice, organizational policy, and/or jurisdictional laws.",
      "derivedFrom": "EHR-S_FM_R1.1 S.1.4.2#2"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-03",
      "label": "AS.2.2#03",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability to manage information regarding the patient's current location (e.g., temporary location of patient).",
      "derivedFrom": "EHR-S_FM_R1.1 S.1.4.2#3"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-05",
      "label": "AS.2.2#05",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability to render information regarding the patient's current location by alternate identifiers (e.g., by arrival number, by alias, or by bed-number).",
      "derivedFrom": "EHR-S_FM_R1.1 S.1.4.2#5"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-06",
      "label": "AS.2.2#06",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY render the de-identified list of patients who have not consented to release of information."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-AS.2.2-07",
      "label": "AS.2.2#07",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render an alert if the patient has exceeded a system-defined time in a location."
    }
  ]
}