{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-POP.2",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMHeader"
    ]
  },
  "name": "POP_2_Support_Population_Based_Epidemiological_Investigation_Surveillance",
  "title": "POP.2 Support Population-Based Epidemiological Investigation/Surveillance (Header)",
  "status": "active",
  "description": "Support for population-based internal and external epidemiological investigations of clinical health of aggregate patient data for use in identifying health risks from the environment, and/or population in accordance with jurisdictional law.",
  "purpose": "A care provider, public health expert, or organization may wish to analyze data from cohorts,(i.e., subpopulations defined by certain characteristics or conditions). For example, cohorts can be described in terms of demographics; education and social status; health status, diseases, or outcomes; industry and occupation; or injuries. Population health analysts, such as experts in public health departments, may compile individual, and/or population information reported or otherwise gathered from multiple EHRs within the jurisdictional area for surveillance and research. Populations of one or none also can be informative. By analyzing specified data for a cohort, public health experts and care providers can monitor disease prevalence and health-related trends; evaluate behavioral, socio-economical, occupational, and other impacts on health; and identify potential outbreaks and associated risk factors. Examples include:\n- examining a cohort of patients with measles for a common (implied) exposure, such as attending the same school - following a cohort of diabetics with out-of-range markers, or analyze them from various perspectives, such as by occupation, blood sugar range, drugs that are being used and not being used.\n- examining a cohort of bakers for a higher-than-expected prevalence of asthma.\n- Upon suspicion of a flu outbreak, reviewing a cohort of patients who have presented in the Emergency Department in the last three days complaining of breathing difficulty.\n- Examining cohorts of smokers with lung disease, sand-blasters with breathing disorders, adults with asthma, etc. A broad range of information is used for population health surveillance and analyses, including (but not limited to) health status/disease/outcomes, completion/results of recommended health screens, current or previous medical treatment data, demographics, education, marital status, social factors, family history of diseases, personal history (e.g., alcohol and tobacco use, reading capability, hearing deficiency), and environmental factors (such as occupation and industry, shift-work, hobby). The information may or may not be coded; the text may be structured or unstructured. Person-level data is used to identify persons with specified characteristics such as exposures, symptoms, risk factors, injuries, genetic markers, diseases or health outcomes that may require further care. Person-level data also is required to evaluate groupings of injuries, diseases or adverse health outcomes. Issues of access to person-level data while securing patient privacy are relevant. Data also may be monitored and analyzed in “aggregate” (for example, by age range, geographic location, socio-economic level, or education level), depicting the quantity of records, and/or content within each aggregate. Aggregates may be used to report de-identified data to public health, for example, cases of influenza-like-illness by age range.\n\nCase and population information are subject to public health reporting. Care organizations may require population health reports, for example, to measure quality of care based on health improvements for populations under the care of their providers. Statistical analyses are a key component to analyzing population health data, such as epidemiological investigations to identify relationships between risks (such as exposures or behaviors) and health conditions. Individual clinicians or healthcare organizations may employ limited capabilities in EHR systems to analyze population health data. The EHR system also should be capable of interacting with, and leveraging, the capabilities of specialized external analytical systems.\n\nThe investigator may hide or mask certain aspects of epidemiological investigation information, as necessary according to scope of practice, policy, and/or law. The investigator may desire to tag or remove patients from the cohort who have relocated or died."
}