{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.5.1",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMHeader"
    ]
  },
  "name": "TI_5_1_Application__Structured_Message__and_Structured_Document_Interchange_Standards",
  "title": "TI.5.1 Application, Structured-Message, and Structured-Document Interchange Standards (Header)",
  "status": "active",
  "description": "Support an EHR system's ability to operate seamlessly with systems that adhere to recognized application interchange standards. These systems include other EHR systems, subcomponents of an EHR system, or other (authorized, non-EHR) systems.",
  "purpose": "Since a health care organization typically has various external and internal interoperability requirements, it must use a set of corresponding interoperability or interchange standards that will meet its connectivity and information structure, format, and semantic requirements. Information should be exchanged -- and applications should provide functionality -- in a manner that appears to be seamless to the user. To be specific, if data is received from an external source that requires a user to manually copy-and-paste that data into multiple parts of the system, the exchange is not considered to be \"seamless\".\n        \nExamples of standards-based EHR information content and exchange methods include: standards-based data extracts, standards-based messages, standards-based documents (e.g., HL7 Clinical Document Architecture (CDA) documents), standards-based healthcare transactions, and standards-based images (e.g., Digital Imaging and Communication in Medicine (DICOM) documents).\n        \nSupport for multiple interaction modes is needed to respond to differing levels of immediacy and types of exchange. For example, messaging is effective for many near-real time, asynchronous data exchange scenarios but may not be appropriate if the end-user is requesting an immediate response from a remote application. \nA variety of interaction modes are typically supported such as:\n- Unsolicited Notifications (e.g., Adam Everyman has arrived at the clinic for his scheduled appointment);\n- Query/Response (e.g., Query: Is Adam Everyman known to the system? Response: Yes, Adam's medical record number is 12345678);\n- Service Request and Response (e.g., Request: Laboratory Order for “Fasting Blood Sugar”. Response: the results of the test);\n- Information Interchange between organizations (e.g., in a regional health exchange or in a national health system);\n- Structured/discrete clinical documents (e.g., a structured clinical note);\n- Unstructured clinical document (e.g., dictated surgical note).\n        \nStandard terminology is a fundamental part of interoperability and is described in function [TI.4](Requirements-EHRSFMR2-TI.4.html). Using a formal explicit information model further optimizes interoperability. An example of an information model is the HL7 Reference Information Model (RIM). Organizations typically need to deal with more than one information model and may need to develop a mapping between information models, a meta-model (that helps to explain and organize the various information models), or both."
}