{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.10",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_10_Standard_or_Preferred_Clinical_Models_and_Clinical_Model_Services",
  "title": "TI.10 Standard or Preferred Clinical Models and Clinical Model Services (Function)",
  "status": "active",
  "description": "Employ approved standard clinical models and clinical model service to ensure data correctness and to enable semantic interoperability (both within an enterprise and externally). Support sets of formal standard clinical models and/or clinical model services.",
  "purpose": "Clinical Model specification. Semantic interoperability requires in addition to standard terminologies that give the meaning to concepts in the EHR also the structural format of data elements, code bindings, relationships, and data types, and their units and value sets where applicable. To allow the vast clinical variations to be facilitated in an EHR system, clinical model specifications are used. Such clinical models adhere to formal standard information models such as templates adhering to the HL7 Reference Information Model, or archetypes according the ISO/EN 13606 Electronic Health Record Communication. However, recently additional clinical models are expressed independent of such standard information models. Examples include models from the Clinical Information Modeling Initiative and ISO TS 13972 based Detailed Clinical Models. \nA clinical model typically specifies the required data element(s) for one or more clinical concepts. The data elements will get unique identifying codes from terminologies as is explained in TI 4. Examples of clinical models include blood pressure, body weight, Apgar score, Glasgow Coma Scale, physical exam, and laboratory result. \n\nClinical Model Services specification.\nThe use of clinical models in an EHR system can vary. The clinical models can be used to specify which data elements should be visible in the user interface, which values should be allowed to select from pull down menu’s or check boxes. For record keeping clinical models can define which data elements should be stored (for instance besides the values the user sees on the screen, and which terminology codes should in addition be stored with the data to maintain the meaning. Also, the clinical models can be used to specify the data exchange for a given use case. \nClinical models may be provided through a clinical model service internal or external to an EHR-S. Typical functions of clinical model services include the runtime provisions of the single clinical model or sets of clinical models. It is also possible to provide specifications for single data elements, and where applicable (versions) of value sets used to populate the data in the EHR-S in a standard manner. In addition, the clinical model service could provide mappings between values from different value sets, e.g. between different versions of value sets, or alternatively mappings between data elements, e.g. from source to target."
}