{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-RI.1.3.4",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "RI_1_3_4_Manage_Record_Entry_Retraction",
  "title": "RI.1.3.4 Manage Record Entry Retraction (Function)",
  "status": "active",
  "description": "Remove a record entry from view if it is deemed erroneous and cite the reason.",
  "purpose": "Record retraction is used to reverse changes that have been made to existing Record Entries. Once a Record Entry has been retracted, it is no longer visible in standard queries, though it remains accessible in EHR audit records, should evidence ever be required for legal or other exceptional circumstances.\n\nCanada Health Infoway provides the following definition for retraction: This mechanism allows an existing record to be “removed” from the EHR if it is deemed erroneous. It can also be used to reverse changes that have been made to an existing record. Once a record has been retracted, it is no longer visible in standard queries, though it remains accessible in EHR audit records should evidence ever be required for legal or other exceptional circumstances. After retracting an erroneous record, a user has the ability to resubmit a corrected record with no visible indication that there was ever a previous version. Retract generally has significant constraints upon its use because of the risks of removing data from a patient's record that might have been used by others in making decisions. The specifics will vary by jurisdiction, and potentially even by type of data.\n\nThere are times that a EHR Record Entry is created then found to be erroneous, i.e., the record may belong to another individual. In these cases, it is necessary to remove that record from view (storing it in case it may be needed for litigation or investigation purposes, etc.). After retracting an erroneous record, a user has the ability to resubmit a corrected record with no visible indication that there was ever a previous version.",
  "statement": [
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-RI.1.3.4-01",
      "label": "RI.1.3.4#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to hide a Record Entry from view and retain it such that it is only visible upon specific request and with appropriate authorization."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-RI.1.3.4-02",
      "label": "RI.1.3.4#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture users who viewed a Record Entry prior to its retraction and notify them of the retraction."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-RI.1.3.4-03",
      "label": "RI.1.3.4#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to capture and retain the reason why a Record Entry was retracted."
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-RI.1.3.4-04",
      "label": "RI.1.3.4#04",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL conform to function [[RI.1.1.17]] (Deprecate/Retract Record Entries)."
    }
  ]
}