{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.5.2",
  "meta": {
    "profile": [
      "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_5_2_Interchange_Standards_Versioning_and_Maintenance",
  "title": "TI.5.2 Interchange Standards Versioning and Maintenance (Function)",
  "status": "active",
  "description": "Support various versions of an interchange standard.",
  "purpose": "Interchange standards characteristically change throughout their lifecycles; those changes are often tagged with \"version\" numbers. EHR systems need to control the various versions of interchange standards that are used within an EHR implementation and accommodate changes that arise with each version.\n\nFor example, if an organization migrates to version 2.5 of HL7's messaging standard, it may choose to utilize that version's specimen or blood bank information capabilities. The organization may also find that certain fields have been retained for backwards compatibility only or withdrawn altogether. The EHR-S needs to be able to handle all of these possibilities.\n\nStandards typically evolve in such a way as to protect backwards compatibility. \n\nOn the other hand, sometimes there is little, or no, backwards compatibility when an organization may need to replace an entire standard with a new methodology. An example of this is migrating from HL7 v2 to HL7 v3. Interchange standards that are backward compatible support exchange among senders and receivers who are using different versions. Version control ensures that those sending information in a later version of a standard consider the difference in information content that can be interchanged effectively with receivers, who are capable of processing only earlier versions. That is, senders need to be aware of the information that receivers are unable to capture and adjust their business processes accordingly.\n\nVersion control enables multiple versions of the same interchange standard to exist and be distinctly recognized over time. Since interchange standards are usually periodically updated, concurrent use of different versions may be required.\n\nLarge (and/or federated) organizations typically need to use different versions of an interchange standard to meet internal organizational interoperability requirements.\n\nFor example, the enterprise-wide standard might use HL7 v2.5 for laboratory messages, but some regions of the enterprise might be at a lower level.\n\nIt should be possible to retire deprecated interchange standards versions when applicable business cycles are completed while maintaining obsolete versions. An example use of this is for possible claims adjustment throughout the claim's life cycle.\n\nWhen interchange standards change over time, it is important that retrospective analysis and research correlate and note gaps between the different versions' information structures to support the permanence of concepts over time.\nExample:\nAn example use of this is the calculation of outcome or performance measures from persisted data stores where one version of a relevant interchange standard, e.g., CDA Release 1 captures the relevant data, e.g., discharge data, differently than CDA Release 2.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.2-01",
      "label": "TI.5.2#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to exchange information with other systems that use different versions of interchange standards.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.2#1"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.2-02",
      "label": "TI.5.2#02",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to exchange information based on updated (or reconfigured) interchange standards and/or based on updated business needs.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.2#2"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.2-03",
      "label": "TI.5.2#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to tag an interchange standard as being deprecated.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.2#3"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-TI.5.2-04",
      "label": "TI.5.2#04",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to integrate with other systems that use previously-supported versions of an interoperability standard according to scope of practice, organizational policy, and/or jurisdictional law.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.2#4"
    }
  ]
}