{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.5.5",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
      "valueCode": "normative"
    }
  ],
  "name": "TI_5_5_System_Integration",
  "title": "TI.5.5 System Integration (Function)",
  "status": "active",
  "description": "Support the integration of the EHR system with related systems.",
  "purpose": "Within a given organization (for example, an institution, facility , or integrated care-delivery network), an EHR system may be directly integrated with other systems (for example, a laboratory Information System, Radiology System, Pharmacy System, or Hospital Information System). Conversely, an EHR system may access these other systems indirectly by integrating with a system that serves as the central routing mechanism for the organization. For example, the EHR system may be integrated with the Hospital Information System which then routes the EHR system's orders to a laboratory , pharmacy, or radiology service.\n\nDepending on the type of information that is exchanged within an integrated-system environment, certain heuristics may be needed that will help govern the information exchange process.\n\nExample(s):\nFor example, an immunization order and a hearing test should be cancelled for a patient who recently died; a heuristic algorithm should manage that cancellation request from the EHR system to interested members within the integrated network. Another example is that certain information imported into a care plan should be exported to some members of the care team, while other members of the care team might only receive a notice that the new information exists.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-TI.5.5-01",
      "label": "TI.5.5#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to integrate the EHR system with other systems (e.g., a laboratory Information System, Radiology System, Pharmacy System, or Hospital Information System) according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.5-02",
      "label": "TI.5.5#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to exchange discrete information (e.g., problem list, medication, and/or allergy information) with an integrated system data repository."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.5-03",
      "label": "TI.5.5#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to exchange clinical documents with an integrated system Clinical Document Repository."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-TI.5.5-04",
      "label": "TI.5.5#04",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY exchange information with systems that are integrated with the EHR system using heuristics that are defined by, and according to scope of practice, organizational policy, and/or jurisdictional law."
    }
  ]
}