{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMSection"
    ]
  },
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
      "valueCode": "normative"
    },
    {
      "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-actors",
      "valueString": "Many TI functions are performed transparently by EHR systems – at least from the perspective of users whose role is primarily clinical. Many TI functions occur in the background without end user intervention. Other actors may interact more directly with TI functions: System Administrators (to manage and monitor system operations, configurations, backups, etc.), Security Administrators (to implement security policies for authentication, authorization, access control, audit, identity and signatures, etc.)."
    }
  ],
  "name": "Trust_Infrastructure",
  "title": "Trust Infrastructure",
  "status": "active",
  "description": "The Trust Infrastructure (TI) Section consists of functions common to an EHR System infrastructure, particularly those functions foundational to system operations, security, efficiency and data integrity assurance, safeguards for privacy and confidentiality, and interoperability with other systems. TI functions are core and foundational to all other functions of the Model (Care Provision, Care Provision Support, Population Health, Administrative Support and Record Infrastructure). Note extensive reference to TI functions in Overarching Criteria. TI functions may be implemented within the architecture of a single system or across a tightly coupled suite of systems (applications).All functions within the Trust Infrastructure Section have an identifier starting with \"TI\".\n\nExample(s):\nCare Provision (CP) and Care Provision Support (CPS) functions must operate in a secure electronic environment. For example, Trust Infrastructure functions provide a secure environment for the CP immunization registration query function. Subsequently a CP function reports (transmits) the child's immunization event in a secure manner via another TI exchange function. TI functions also transparently provide other essential services, such as periodic backups of a child's health record and an audit trail of all accesses to that record."
}