{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-AS.5",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMHeader"
    ]
  },
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
      "valueCode": "normative"
    }
  ],
  "name": "AS_5_Manage_Clinical_Workflow_Tasking",
  "title": "AS.5 Manage Clinical Workflow Tasking (Header)",
  "status": "active",
  "description": "Create, schedule, update and manage tasks with appropriate timeliness.",
  "purpose": "Since an electronic health record will replace the paper chart or other paper-based system, tasks that were based on the paper artifact must be effectively managed in the electronic environment. Functions must exist in the EHR-S that support electronically any workflow that previously depended on the existence of a physical artifact (such as the paper chart, a phone message slip) in a paper based system. Tasks differ from other more generic communication among participants in the care process because they are a call to action and target completion of a specific workflow in the context of a patient's health record (including a specific component of the record). Tasks also require disposition (final resolution). The initiator may optionally require a response. \n\nFor example, in a paper based system, physically placing charts in piles for review creates a physical queue of tasks related to those charts. This queue of tasks (for example, a set of patient phone calls to be returned) must be supported electronically so that the list (of patients to be called) is visible to the appropriate user or role for disposition. The state transition (e.g., created, performed and resolved) may be managed by the user explicitly or automatically based on rules. For example, if a user has a task to signoff on a test result, that task should automatically be marked complete by the EHR when the test result linked to the task is signed in the system. Patients will become more involved in the care process by receiving tasks related to their care.\n\nExample(s):\nExamples of patient related tasks include acknowledgement of receipt of a test result forwarded from the provider, or a request to schedule an appointment for a pap smear (based on age and frequency criteria) generated automatically by the EHR-S on behalf of the provider."
}