{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-RI",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMSection"
    ]
  },
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status",
      "valueCode": "normative"
    },
    {
      "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-actors",
      "valueString": "Many RI functions are performed transparently by EHR systems – at least from the perspective of users whose role is primarily clinical. Many RI functions occur in the background without end user intervention. Other actors may interact more directly with RI functions: System Administrators (to create archives of historical patient encounters or to purge records after their legal retention period has expired)."
    }
  ],
  "name": "Record_Infrastructure",
  "title": "Record Infrastructure",
  "status": "active",
  "description": "The Record Infrastructure Section consists of functions common to EHR System record management, particularly those functions foundational to managing record lifecycle (origination, attestation, amendment, access/use, translation, transmittal/disclosure, receipt, de-identification, archive…) and record lifespan (persistence, indelibility, continuity, audit, encryption). RI functions are core and foundational to all other functions of the Model (CP, CPS, POP, AS). Note extensive reference to RI functions in Overarching Criteria. RI functions may be implemented within the architecture of a single system or across a tightly coupled suite of systems (applications).All functions within the Record Infrastructure Section have an identifier starting with “RI”.\n\nExample(s):\nCare Provision (CP) and Care Provision Support (CPS) functions are invoked by Actors taking Actions (i.e., caregivers documenting care provision). Most all Actions taken to support individual health or to provide healthcare are captured by the EHRS and persistently evidenced in the EHR record. For example, CP immunization administration functions create EHR record entries which must be persisted over time. These same entries form the basis for transmittal to central immunization registries."
}