{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.5.4",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_5_4_Interchange_Agreements",
  "title": "TI.5.4 Interchange Agreements (Function)",
  "status": "active",
  "description": "Support the use of Interchange Agreements to specify the rules, responsibilities, expectations, and methods by which Interchange Agreement partners may exchange information.",
  "purpose": "Systems that wish to communicate with each other must agree on certain parameters/criteria that will govern an information exchange process. Interchange agreements enable partnering systems to discover, negotiate, and utilize those parameters/criteria. An EHR-S can use this information to define how data will be exchanged between the sending and the receiving partners. Interchange services and capabilities can be discovered in an automated fashion.\n\nEntity directories can be used to determine the address, profile, and data exchange requirements of known, and/or potential Interchange Agreement partners. Entity registries can be used to determine the security, addressing, and reliability requirements between potential Interchange Agreement partnering systems.\n\nExample(s):\nExamples of services that may be provided by the use of Interchange Agreements:\n- A new application can automatically determine the source of a patient's demographic information by using a Universal Description and Discovery Integration (UDDI) service. The new application can then retrieve the Web Services Description Language (WSDL) specification to discover the binding details.\n- Good Health Hospital, a member of AnyCounty LabNet, shares laboratory results with other partners. Good Health Hospital periodically queries LabNet's directory (UDDI) to determine whether new information providers have joined LabNet. When new information providers are discovered, the Good Health Hospital IT system establishes the appropriate service connections based upon the Service Description (WSDL).\n- A clinical research sponsor submits an interchange agreement to a registry. Various EHR systems access that registry to discover the clinical research sponsor's contact information.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.4-01",
      "label": "TI.5.4#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL exchange information with Interchange Agreement partners based on interoperability agreement descriptions.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.4#1"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-TI.5.4-02",
      "label": "TI.5.4#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": true,
      "requirement": "IF an interchange agreement description specifies the use of a certain standard, THEN the system SHOULD exchange information using the standard specified by the interchange agreement description according to scope of practice, organizational policy, and/or jurisdictional law.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.4#2"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.4-03",
      "label": "TI.5.4#03",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY conform to function [TI.3](Requirements-EHRSFMR2-TI.3.html) (Registry and Directory Services) to interact with registries, and/or directories to determine the address, profile, and data exchange requirements of known, and/or potential partners.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.4#3"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-TI.5.4-04",
      "label": "TI.5.4#04",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY analyze and present interchange service descriptions and capabilities according to scope of practice, organizational policy, and/or jurisdictional law.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.5.4#4"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.5.4-05",
      "label": "TI.5.4#05",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to manage Interchange Agreements that have been established with Interchange Agreement partners."
    }
  ]
}