{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.1.9",
  "meta": {
    "profile": [
      "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_1_9_System_Operation_Measurements",
  "title": "TI.1.9 System Operation Measurements (Function)",
  "status": "active",
  "description": "Manage the change of status of an external facility.",
  "purpose": "A health care delivery relies on services provided by other external facilities such as laboratories or Long Term Care facilities. The status of those facilities is subject to change for example: power outage, flooding or overcapacity. Therefore, the EHR system needs to capture the status of the external facilities, notify appropriate individuals / organizations or even change the workflow based on established business rules. Change of the status of an external facility is patient safety concern because a provider may need to adjust patient care or care workflows accordingly. For example, changes of status of external facility include: laboratory no longer accredited, laboratory power outage, Long Term Care facility at overcapacity. If laboratory loses accreditation an administrator needs to be notified to adjust the workflow. If status change is anticipated on regular basis, the system may automatically trigger workflow adjustment according to established business rule that take in consideration the status of the external facility. The example for later, the local Long Term Care facility may routinely exceed the capacity on the weekends; therefore, the business rule will accommodate for automatic workflow adjustments.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.1.9-01",
      "label": "TI.1.9#01",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to manage the change of status of an external facility."
    }
  ]
}