{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-TI.10.3",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_10_3_Clinical_Model_Mapping",
  "title": "TI.10.3 Clinical Model Mapping (Function)",
  "status": "active",
  "description": "Map or translate one clinical model to another as needed by local, regional, national, or international interoperability requirements.",
  "purpose": "The ability to map or translate one clinical model to another is fundamental to an organization in an environment where several clinical models are in play to meet different purposes. It is a common occurrence that data is captured using one clinical model, but is shared using another clinical model.\n\nExample(s):\nExample: Within a healthcare organization there may be a need to map terminology concepts with the same semantic meaning to meet different purposes (e.g., between an EHRS and an external laboratory system, or between an EHRS and a billing system). Standard terminologies are evolving and maps will need to be adjusted to support this evolution and more sophisticated use of standard terminologies and maps over time.\n\nRealm specific (including local, regional, national or international) interoperability requirements can also determine the need for clinical model mapping, and in many cases mapping services (internal or external) can be used to satisfy these requirements.\n\nThe interaction and mapping of clinical models may be called into question in a legal proceeding, when clinical decisions were documented or when semantic meaning could be misinterpreted. It is important to seek guidance, document and retain all mapping decisions for all types of clinical model mapping, and to recognize when mapping may not be possible from one clinical model to another. The quality of mapping is dependent upon the skills and interpretation of standard clinical models and clinical information by mapping experts.\n\nNote: the mapping of one clinical model to another is mostly done on the level of data elements and value sets. The importance of data is changing over time and to prevent a trend break in research data is mapped to keep old data and use that data in the analysis.$EX$",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.10.3-01",
      "label": "TI.10.3#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage data using clinical model maps which may be provided by mapping services (internal or external)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.10.3-02",
      "label": "TI.10.3#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to update clinical model maps using standard clinical model services (internal or external)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.10.3-03",
      "label": "TI.10.3#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render data quality and technical quality reports for a user to determine the validity of clinical model mappings using approved mapping techniques."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.10.3-04",
      "label": "TI.10.3#04",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability for a user to maintain custom clinical model maps using approved mapping techniques where formal standard clinical model maps are unavailable."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2-TI.10.3-05",
      "label": "TI.10.3#05",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability for a user to maintain custom clinical model maps to formal standard clinical model maps in order to support historical data use.\n"
    }
  ]
}