{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-TI.4.3",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "TI_4_3_Terminology_Mapping",
  "title": "TI.4.3 Terminology Mapping (Function)",
  "status": "active",
  "description": "Map or translate one terminology to another as needed by local, regional, national, or international interoperability requirements.",
  "purpose": "The ability to map or translate one terminology to another is fundamental to an organization in an environment where several terminologies are in play to meet different purposes. It is a common occurrence that data is captured using one terminology, but is shared using another terminology.\n\nExample: Within a healthcare organization there may be a need to map terminology concepts with the same semantic meaning to meet different purposes (e.g., between an EHRS and an external laboratory system, or between an EHRS and a billing system). Standard terminologies are evolving and maps will need to be adjusted to support this evolution and more sophisticated use of standard terminologies and maps over time.\n\nRealm specific (including local, regional, national or international) interoperability requirements can also determine the need for terminology mapping, and in many cases terminology mapping services (internal or external) can be used to satisfy these requirements.\n\nThe interaction and mapping of terminologies may be called into question in a legal proceeding, when clinical decisions were documented or when semantic meaning could be misinterpreted. It is important to seek guidance, document and retain all mapping decisions for all types of terminology mapping, and to recognize when mapping may not be possible from one concept to another. The quality of mapping is dependent upon the skills and interpretation of standard terminologies and clinical information by mapping experts.",
  "statement": [
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.4.3-01",
      "label": "TI.4.3#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage data using terminology maps which may be provided by terminology mapping services (internal or external).",
      "derivedFrom": "EHR-S_FM_R1.1 IN.4.3#1"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.4.3-02",
      "label": "TI.4.3#02",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to update terminology maps using standard terminology services (internal or external).",
      "derivedFrom": "EHR-S_FM_R1.1 IN.4.3#2"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.4.3-03",
      "label": "TI.4.3#03",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render data quality and technical quality reports for a user to determine the validity of terminology mappings using approved mapping techniques.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.4.3#3"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.4.3-04",
      "label": "TI.4.3#04",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability for a user to maintain custom terminology maps using approved mapping techniques where formal standard terminology maps are unavailable.",
      "derivedFrom": "EHR-S_FM_R1.1 IN.4.3#4"
    },
    {
      "extension": [
        {
          "url": "${BASE}/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-TI.4.3-05",
      "label": "TI.4.3#05",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability for a user to maintain custom terminology maps to formal standard terminology maps in order to support historical data use."
    }
  ]
}