{
  "resourceType": "Requirements",
  "id": "EHRSFMR2.1-POP.2.1",
  "meta": {
    "profile": [
      "http://hl7.org/ehrs/StructureDefinition/FMFunction"
    ]
  },
  "name": "POP_2_1_Support_for_Epidemiological_Investigation_Surveillance_Data_Collection",
  "title": "POP.2.1 Support for Epidemiological Investigation/Surveillance Data Collection (Function)",
  "status": "active",
  "description": "Support for Person-Level and Aggregate-Level Queries to Generate Population Cohorts, and/or Aggregates to be used in epidemiologic investigations and reports.",
  "purpose": "Population health analysts (investigators) examine health data for trends and conditions through the use of well-defined queries to create their data sets. Preparing such well-defined queries, i.e., selection criteria and parameters, used to generate a cohort can be a complex and iterative process. The investigator may desire to use pre-defined or self-constructed queries (which may be saved for reuse). During the process of defining a query, the investigator may desire to accumulate statistics regarding the results of interim queries (e.g., number of patients in the query result) to determine the suitability of the queries, and subsequently modify the final query. \n\nThe investigator maintains sets of queries by constructing names that depict the cohorts, the fields comprising the queries and, perhaps, values for those fields. The resultant data set generated should be validated against the intended purpose of the query. Queries may need to be saved to support future analysis of the same (or a similar) cohort. For example, the investigator may construct an \"Insulin study for males age 65 and older\" query that is used to review patients of a specific age, gender and drug usage, then also construct an “Insulin study for females age 65 and older” query by modifying a copy of the first one. Queries may identify “static” or “dynamic” cohorts. A “static cohort” query identifies and monitors certain patients within a given cohort over time (e.g., pregnant patients who arrived in the Emergency Department in January, 2012 and followed throughout their pregnancies). \n\nA “dynamic cohort” query may identify new patients to be added periodically to a cohort (e.g., the number of pregnant patients who arrived in the Emergency Department during each month). Information compiled by using a query may need to be governed by applicable policies and regulations. For example, psychiatric data may need to be excluded from a given epidemiological investigation. The query may need to specify that subjects are de-identified or aggregates are created according to the requirements of the analysis or privacy restrictions. For example, queries may be made of de-identified aggregate subjects to evaluate possible medical products safety issues quickly and securely. Data aggregation may be used to de-identify subjects, to condense the cohort, or to sub-divide a given cohort into various \"aggregates\" (for example, by age range, geographic location, socio-economic level, or education level), depicting the quantity of records, and/or content within each aggregate. Aggregate data may need to be integrated or linked d within or across cohorts. The criteria for data aggregation also may be applied to different cohorts.",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-01",
      "label": "POP.2.1#01",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage queries (e.g., criteria and parameters based on surveillance parameters, demographic, and/or clinical information) for use in extracting one or more cohorts, and/or aggregates according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-02",
      "label": "POP.2.1#02",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and maintain pre-defined criteria and parameters (e.g., based on demographic, and/or clinical information) for use in extracting one or more cohorts, and/or aggregates."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-03",
      "label": "POP.2.1#03",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and maintain ad hoc criteria and parameters specified by the user (e.g., based on demographic, and/or clinical information) for use in extracting one or more cohorts, and/or aggregates"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-04",
      "label": "POP.2.1#04",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to capture and render the attributes (namely, the metadata) of a query (for example, query name, description, fields, values, and/or assumptions)."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-05",
      "label": "POP.2.1#05",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to maintain new cohort or cohorts."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-06",
      "label": "POP.2.1#06",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to integrate previously-defined cohorts."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-07",
      "label": "POP.2.1#07",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to integrate previously-defined aggregates within a cohort, and/or across cohorts and maintain the new aggregate or aggregates."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-08",
      "label": "POP.2.1#08",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage data-visibility as a query component according to scope of practice, organizational policy, and/or jurisdictional law"
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-09",
      "label": "POP.2.1#09",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render indicators (e.g., to investigators, caregivers or patients) regarding the queries in which a certain patient was included according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-10",
      "label": "POP.2.1#10",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD conform to function [[TI.5.3]] (Standards-Based Application Integration) to suppport the creation of a query."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-11",
      "label": "POP.2.1#11",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage ad hoc inquiries from public health organizations (e.g., requests for information related to demographic or clinical information) according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-12",
      "label": "POP.2.1#12",
      "conformance": [
        "SHALL"
      ],
      "conditionality": false,
      "requirement": "The system SHALL provide the ability to manage case-reporting requirements defined by public health organizations as queries according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/ehrs/StructureDefinition/requirements-dependent",
          "valueBoolean": false
        }
      ],
      "key": "EHRSFMR2.1-POP.2.1-13",
      "label": "POP.2.1#13",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability to capture, maintain, and render sets of questions that support disease outbreak investigations (e.g., disease-exposure questionnaires, disease-tranmission contact tracing). The sets of questions are authored by public health authorities and facilitate patient-information gathering by the care provider.",
      "derivedFrom": "PHFP DC.2.6.2#9"
    }
  ]
}