{
  "resourceType": "Requirements",
  "id": "EHRSFMR2-AS.4.3",
  "meta": {
    "profile": [
      "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/FMFunction"
    ]
  },
  "name": "AS_4_3_Support_for_Communications_Between_Organizations",
  "title": "AS.4.3 Support for Communications Between Organizations (Function)",
  "status": "active",
  "description": "Facilitate communications regarding patient orders, data and status between organizations.",
  "purpose": "There needs to be an ability to communicate patient data and status (e.g., patient history, patient physical examination), discrete clinical data (e.g., blood pressure, pulse, temperature, pulse oximetry, laboratory data, microbiology data, radiology data), and orders(e.g., medications, tests) between health care organizations, particularly during patient transfers.\n\nThis information may include items such as outstanding patient requests, clinician care recommendations, and outstanding treatment and workflow tasks for the patient. Organizations can include both health care providing organizations (e.g., hospitals, nursing homes) and non-health care providing organizations (e.g., funeral homes, disaster operations, employers).",
  "statement": [
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-AS.4.3-01",
      "label": "AS.4.3#01",
      "conformance": [
        "SHOULD"
      ],
      "conditionality": false,
      "requirement": "The system SHOULD provide the ability to render patient transfer information to other health care organizations (e.g., hospitals, clinics, specialists, nursing homes) according to scope of practice, organizational policy, and/or jurisdictional law."
    },
    {
      "extension": [
        {
          "url": "http://hl7.org/fhir/uv/ehrsfmr2/StructureDefinition/requirements-dependent",
          "valueBoolean": true
        }
      ],
      "key": "EHRSFMR2-AS.4.3-02",
      "label": "AS.4.3#02",
      "conformance": [
        "MAY"
      ],
      "conditionality": false,
      "requirement": "The system MAY provide the ability to render selected patient transfer information to non-health care organizations (e.g., funeral home) according to scope of practice, organizational policy, and/or jurisdictional law."
    }
  ]
}